{
  "facts": [
    "League of Legends (LoL) was released on October 27, 2009.",
    "As of 2021, League of Legends has over 120 million monthly active players.",
    "The game was developed and published by Riot Games.",
    "LoL is a multiplayer online battle arena (MOBA) game.",
    "Riot Games was founded by Marc Merrill and Brandon Beck.",
    "There are currently 156 champions available in League of Legends.",
    "League of Legends has over 40 million players competing in ranked play.",
    "The game has a professional esports scene with multiple leagues and tournaments.",
    "The Summoner's Rift is the most popular and iconic map in the game.",
    "The game's lore is set in a world called Runeterra.",
    "Riot Games has released various spin-off games and media related to the League of Legends universe.",
    "The game's primary objective is to destroy the enemy team's Nexus.",
    "The in-game currency is called Riot Points (RP) and can be used to purchase champions, skins, and other items.",
    "League of Legends has different game modes, including Summoner's Rift, ARAM, and Teamfight Tactics.",
    "The game has an elaborate ranked system with different tiers and divisions.",
    "Riot Games regularly releases new champions to keep the game fresh and diverse.",
    "Some champions in League of Legends have multiple forms or transformations, such as Kayn and Gnar.",
    "The game has a robust competitive season with rewards for reaching higher ranks.",
    "There are several roles in the game, including top lane, jungle, mid lane, AD carry, and support.",
    "Riot Games hosts an annual World Championship, which is the biggest esports event for League of Legends.",
    "League of Legends has a dedicated community of streamers and content creators.",
    "The game's map, Summoner's Rift, underwent a major visual update in 2014.",
    "League of Legends has a wide range of skins, offering different visual and thematic changes to champions.",
    "There are different types of dragons in the game, which grant powerful buffs to the team that slays them.",
    "The game's lore includes various factions and regions, such as Demacia, Noxus, and Piltover.",
    "Riot Games introduced a unique champion-select system called the 'draft pick.'",
    "League of Legends has a system called 'runes' that allows players to customize their champion's abilities and stats.",
    "There are different game modes in League of Legends, including ranked, normal, and custom games.",
    "Riot Games created a game mode called 'Ultra Rapid Fire' (URF), which features extremely fast-paced and chaotic gameplay.",
    "Some champions in League of Legends are known for their complex mechanics and high skill ceiling, such as Yasuo and Zed.",
    "Riot Games implemented a 'ping' system that allows players to communicate quickly and efficiently with their teammates.",
    "The game has an honor system that encourages positive behavior and rewards players for sportsmanship.",
    "Riot Games introduced a role selection feature to help players get their preferred roles in matchmaking.",
    "League of Legends has a free rotation system that allows players to try out different champions each week.",
    "The game has a robust esports ecosystem, with regional leagues in different parts of the world.",
    "Riot Games partnered with Marvel Comics to release a League of Legends comic book series.",
    "League of Legends has a dedicated subreddit with a large and active community.",
    "Riot Games regularly balances and updates the game to ensure fair gameplay and address any issues or imbalances."
  ]
}
